In [1]:
import sqlite3

In [2]:
# Create connection
conn = sqlite3.connect('school.db') 
cursor = conn.cursor()

In [3]:
# Create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS students (
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                name TEXT, 
               age INTEGER, 
               gender TEXT )''')
cursor.execute('''CREATE TABLE IF NOT EXISTS courses (
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                name TEXT,
                credits INTEGER )''')
cursor.execute('''CREATE TABLE IF NOT EXISTS enrollments ( 
                id INTEGER PRIMARY KEY AUTOINCREMENT, 
                student_id INTEGER,
                course_id INTEGER, 
                grade REAL, 
                FOREIGN KEY(student_id) REFERENCES students(id),
                FOREIGN KEY(course_id) REFERENCES courses(id) )''')

In [4]:
# Insert sample data

cursor.executemany('INSERT INTO students (name, age, gender) VALUES (?, ?, ?)', [

('Alice', 22, 'F'),

('Bob', 20, 'M'),

('Charlie', 23, 'M')

])


cursor.executemany('INSERT INTO courses (name, credits) VALUES (?, ?)', [

('Math', 3),

('Science', 4),

('History', 2)

])


cursor.executemany('INSERT INTO enrollments (student_id, course_id, grade) VALUES (?, ?, ?)', [

(1, 1, 85),

(1, 2, 90),

(2, 1, 78),

(3, 3, 88)

])


conn.commit()

In [7]:
cursor.execute('SELECT * FROM students')
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M')]

In [ ]:
# Insert a new Student 
cursor.execute("INSERT INTO students (name, age, gender) VALUES ('Amira', 22, 'F')")
conn.commit()

In [9]:
cursor.execute('SELECT * FROM students')
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M'), (4, 'Amira', 22, 'F')]

In [10]:
#filter Student order than 21 
cursor.execute('SELECT * FROM students WHERE age>21')
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (3, 'Charlie', 23, 'M'), (4, 'Amira', 22, 'F')]

In [ ]:
cursor.execute('''SELECT s.name,e.grade 
               FROM students s 
               JOIN  enrollments e on s.id=e.student_id
                WHERE grade BETWEEN 80 AND 90''')
print(cursor.fetchall())

[('Alice', 85.0), ('Alice', 90.0), ('Charlie', 88.0)]

In [28]:
cursor.execute('''SELECT * FROM students 
               ORDER BY age DESC''')
print(cursor.fetchall())

[(3, 'Charlie', 23, 'M'), (1, 'Alice', 22, 'F'), (4, 'Amira', 22, 'F'), (2, 'Bob', 20, 'M')]

In [29]:
cursor.execute('''SELECT s.name,c.name 
               FROM students s 
               INNER JOIN  enrollments e on s.id=e.student_id
               INNER JOIN  courses c on c.id=e.course_id
           ''')
print(cursor.fetchall())

[('Alice', 'Math'), ('Alice', 'Science'), ('Bob', 'Math'), ('Charlie', 'History')]

In [40]:
cursor.execute('''SELECT s.name as student_Name, e.grade,c.name
               FROM students s 
               JOIN enrollments e ON s.id = e.student_id
               JOIN courses c ON c.id=e.course_id
               WHERE c.name='Math' AND e.grade > 80''')
print(cursor.fetchall())

[('Alice', 85.0, 'Math')]